print('Здесь будет выведен расчет аванса и средний заработок в день за месяц в 2024 году при графике 5/2 "НА РУКИ"')
zarplata = int(input('Сколько за месяц получаешь денег "НА РУКИ"?\n'))
while 190000 < zarplata or zarplata < 19500:
    print(f'{zarplata}? Ты че, введи сумму честно')
    zarplata = int(input('Сколько за месяц получаешь денег "НА РУКИ"?\n'))
months = {
    'январь': 17, 'февраль': 20, 'март': 20,
    'апрель': 21, 'май': 20, 'июнь': 19,
    'июль': 23, 'август': 22, 'сентябрь': 21,
    'октябрь': 23, 'ноябрь': 21, 'декабрь': 21,
}
month = input('За какой месяц желаешь узнать расчет?\n')
while month.lower() not in months:
    print(f'{month}? Это что? введи месяц нормально, например "март".')
    may = input('За какой месяц желаешь узнать расчет?\n ')
avans_Y_or_N = input('Знаешь какой процент от зарплаты составляет аванс у тебя? (да/нет)\n')
if avans_Y_or_N == 'да':
    avans_percent = int(input('Отлично. И сколько он? Обычно 40-50%\n'))
    if 51 < avans_percent or avans_percent < 29:
        print('Неккоректный ввод. Введи целое число от 30 до 50.')
        avans_percent = int(input('какой процент от зп составляет аванс?\n '))
elif avans_Y_or_N == 'нет':
    avans_percent = 45
    print('Ну нет так нет, возьму среднее значение - 45%')
else:
    print('Я думал, ты запустил эту прогу не для игр! Всего доброго!')
progul = int(input('Сколько рабочих дней ты пропустил? (отпуск без сохранения зп)\n'))
true_zarplata = zarplata - (zarplata/months[month]) * progul
one_day_zp = true_zarplata/months[month]
avans_ = true_zarplata * (avans_percent / 100)
zp_ostatok = true_zarplata - avans_

# сделать расчет пропускал ли рабочие дни!!!! чтоб их ВЫЧЕСТЬ из количества раб.дней в месяце

print('Итак, подводим итоги для графика 5/2:')
print(f'''
Вы указали зарплату:                    {'{0:,}'.format(zarplata).replace(',', ' ')} рублей
С учетом пропуска рабочих дней({progul}): {'{0:,}'.format(true_zarplata.__round__()).replace(',', ' ')} рублей
Вы указали месяц:               {month.upper()}

Количество рабочих дней в этом месяце: {months[month] - progul} 
Средняя оплата за 1 рабочий день:      {'{0:,}'.format(one_day_zp.__round__()).replace(',', ' ')} рублей
Аванс в этом месяце составит:          {'{0:,}'.format(avans_.__round__()).replace(',', ' ')} рублей
Зарплата(остаток) в этом месяце будет: {'{0:,}'.format(zp_ostatok.__round__()).replace(',', ' ')} рублей

''')
input('Нажмите "Enter" для выхода!')
